rhombus (copy)/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
       
       type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
       
         type            zeroGradient;
    }

    left
    {
         type            zeroGradient;
    }
    right
    {
         type            zeroGradient;
    }

   
    obstacle
    {
        type            zeroGradient;
    }

   topAndBottom
    {
        type            empty;
    }
}

// ************************************************************************* //
