rhombus (copy)/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {   
        type            fixedValue;
        value           uniform (694.45 0 0);
    }

    outlet
    {
         type            zeroGradient;
    }

    left
    {
       type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }

    

    obstacle
    {
        type            slip;
    }

    topAndBottom
    {
        type            empty;
    }
}

// ************************************************************************* //
