rhombus (copy)/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 101325;
    }

    outlet
    {
        type            zeroGradient;
    }

    left
    {
         type            zeroGradient;
    }
    right
    {
         type            zeroGradient;
    }
    obstacle
    {
        type            zeroGradient;
    }

   topAndBottom
    {
        type            empty;
    }
}

// ************************************************************************* //
